In [3]:
import pandas as pd

# Задача 1

In [6]:
# чтение источников
movies = pd.read_csv('Файлы ДЗ 5 к заданию №1/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [8]:
ratings = pd.read_csv('Файлы ДЗ 5 к заданию №1/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [53]:
# join двух датафреймов в один по movieId
merged = pd.merge(movies, ratings, on=['movieId'])

# фильтрация по оценке 5.0
merged = merged[ merged['rating'] == 5 ]

# подсчет оценок 5.0 по каждому фильму
rate_ordering = merged['title'].value_counts().sort_values(ascending=False).reset_index()
rate_ordering.head()

                                       title  count
0           Shawshank Redemption, The (1994)    153
1                        Pulp Fiction (1994)    123
2                        Forrest Gump (1994)    116
3                         Matrix, The (1999)    109
4  Star Wars: Episode IV - A New Hope (1977)    104

In [85]:
max_ordered = rate_ordering['title'][0]
print(f"Ответ: больше всего оценок 5.0 выставлену фильму '{max_ordered}'")

Ответ: больше всего оценок 5.0 выставлену фильму 'Shawshank Redemption, The (1994)'

# Задача 2

In [86]:
# вычитываем данные из источника
power = pd.read_csv('Файлы ДЗ 5 к заданию №2/power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [87]:
# фильтруем данные по условию задачи
filtered = power[ 
        (power['country'].isin(['Latvia', 'Estonia', 'Lithuania']))
      & (power['category'].isin([4, 12, 21]))
      & (power['year'] >= 2005)
      & (power['year'] <= 2010)
      & (power['quantity'] > 0)      
]

filtered.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4

In [88]:
consumption = filtered['quantity'].sum()
print(f"Ответ: суммарное потребление стран Прибалтики в категории 4, 12 и 21 за 2005-2010 года: {consumption}")

Ответ: суммарное потребление стран Прибалтики в категории 4, 12 и 21 за 2005-2010 года: 240580.0